<!DOCTYPE html>
<html lang="en">

<head>
    <meta charset="UTF-8">
    <meta name="viewport" content="width=device-width, initial-scale=1.0">
    <title>snakes</title>
    <link rel="stylesheet" href="style.css">
    <link rel="stylesheet" href="https://cdn.jsdelivr.net/npm/bootstrap@5.3.2/dist/css/bootstrap.min.css">
    <link rel="stylesheet" href="https://cdnjs.cloudflare.com/ajax/libs/font-awesome/6.5.1/css/all.min.css" integrity="sha512-DTOQO9RWCH3ppGqcWaEA1BIZOC6xxalwEsw9c2QQeAIftl+Vegovlnee1c9QX4TctnWMn13TZye+giMm8e2LwA==" crossorigin="anonymous" referrerpolicy="no-referrer" />
</head>

<body class="bg ">
    <div class="container mb-3  mt-1 rounded ">
        <!-- nav bar  -->
        <div class="d-flex justify-content-between ">
            <div class="">
                <a href="index.php">
                    <h1 class="text-white m-2"><i class="fa-solid fa-staff-snake"></i></h1>
                </a>
            </div>
            <div class="">
                <h1 class="text-white m-2">Snakes</i></h1>
            </div>
            <div class="">
                <a href="index.php">
                    <h1 class="text-white m-2"><i class="fa-solid fa-staff-snake"></i></h1>
                </a>
            </div>
        </div>

        <!-- description  -->
        <div class="col-6 ">
            <div class="mt-4 ">
                <h3 class="text-white">မြွေ[Snake]</h3>

                <span class="text-white ">မြွေသည် ရက်ပတီလီယာ မျိုးပေါင်းတွင် စကွာမေတာမျိုးစဉ် ဆာပင်တီး မျိုးစဉ်ခွဲ၌ ပါဝင်၏။ မြွေကို ကိုင်ကြည့်လျှင် အေးခြင်းမှာ ယင်းသည် သွေးအေး သတ္တဝါဖြစ်ခြင်းကြောင့် ဖြစ်သည်။ လူတို့သည် မြွေကို များသောအားဖြင့် ကြောက်၏။ ထိုအချက်ကြောင့်ပင် မြွေကို ကြောက်စိတ်မရှိသူများအဖို့နှင့် ကြောက်စိတ်ကို ကျော်လွန်နိုင်သူများအဖို့ မြွေသည် ပို၍ စိတ်ဝင်စားဖွယ် ကောင်းလာလေသည်။ မြွေကို လူသည် မွေးကတည်းက ကြောက်မလာချေ။ ကလေးသည် မြွေကို ကြောက်စိတ်နှင့် ကြည့်သည့်ထက် စိတ်ဝင်စားစွာ ကြည့်သည်က များသည်။

                    Python
                    မြန်မာစပါးကြီးမြွေ
                    ခြေထောက် မရှိသော တွားသွားသတ္တဝါများတွင် မြွေကို လူသိအများဆုံးဖြစ်သည်။ မြွေကို အခြားဒေသများတွင် တွေ့ရသည်ထက် မြန်မာနိုင်ငံကဲ့သို့သော အပူပိုင်းဒေသများတွင် ပို၍ တွေ့ရသည်။ အကြီးဆုံး မြွေများကိုလည်း အပူပိုင်း ဒေသများတွင်သာ ပို၍ တွေ့ရသည်။ အချို့မြွေများသည် ပေ ၃ဝ အထိ ရှည်တတ်ကြသကဲ့သို့ ငါးလက်မထက်ပို၍ မရှည်သော မြွေကလေးများကိုလည်း တွေ့ရသည်။ နယူးဇီယန်၊ အိုင်ယာလန် နှင့် ဟာဝိုင်းယန်းကျွန်းများတွင် မြွေကို မတွေ့ရချေ။ ဟာဝိုင်းယန်းကျွန်းတွင်မူ နောင်အခါ၌ ဘေးမပြုသော မြွေများကို ယူဆောင်သွားကြသဖြင့် တွေ့ရလေသည်။

                    မျိုးစိတ်ပေါင်း ၂၃ဝဝ ခန့်ရှိသော မြွေများကို အနည်းငယ်မျှသော ကျွန်းများနှင့် အလွန်အေးသည့် ဒေသများမှအပ ကျန်ဒေသများတွင် တွေ့နိုင်သည်။ အပူပိုင်းဒေသရှိ အလွန်ထူထပ်သော တောများမှအစ၊ သဲကန္တာရများ၊ တောင်ထိပ်များနှင့် မြေကြီးအောက်ရှိ တွင်းများအဆုံးထိ တွေ့နိုင်၏။ အချို့သော မြွေများကို သစ်ပင်များပေါ်တွင် အနေများသည်။ အချို့ကို စိမ့်များ၊ ရေချိုအိုင်များနှင့် မြစ်များတွင် တွေ့ရသည်။

                    အချို့ကိုမူ ပင်လယ်များအတွင်း၌ တွေ့ရလေသည်။ ထိုပင်လယ်မြွေများကို အာရှတိုက်၊ အာဖရိကတိုက်နှင့် ထိစပ်လျက်ရှိသော အပူပိုင်းဒေသ ပင်လယ်များတွင် အတွေ့ရများသည်။ ပင်လယ်မြွေများ၏ နံဘေးသည် ပြားနေကြသဖြင့် ရေကူးရာ၌ လွန်စွာ သန်ကြသော်လည်း ကုန်းပေါ်တွင်မူ ကောင်းစွာ မသွားနိုင်ကြချေ။ ပင်လယ်မြွေများသည် မျိုးစိတ်အားဖြင့် ၅ဝ ခန့် ရှိ၍ အားလုံးသည် လွန်စွာ အဆိပ်ပြင်းကြလေသည်။ ယင်းတို့၌ အဆုတ်ကြီးများရှိသဖြင့် ရေနက်များတွင် နေနိုင်ကြ၍ စားရန် ငါးများကို လိုက်ဖမ်းကြလေသည်။

                    .
                    အန်ဒါမန်ကျွန်း၌တွေ့ရသော ရေမြွေ
                    မြွေများ၌ မျက်ခွံများ မရှိကြချေ။ ထိုကြောင့် မည်သည့်အခါမျှ မျက်စိကို မမှိတ်ကြချေ။ မျက်စိများကို ကာကွယ်ရန် ပျဉ်းတွဲသော အလင်းပေါက်အမြှေးရှိသည်။ ထိုသို့သော မျက်စိမျိုးရှိခြင်းကြောင့် ယင်းအား သားကောင်ကို ညှို့နိုင်စွမ်းရှိသည်ဟု အများက ထင်ကြခြင်းဖြစ်သည်။ မြွေသည် ယင်း၌ အခြားတိရစ္ဆာန်များမှာကဲ့သို့ ခြေထောက်များ မရှိသဖြင့် နံရိုးများဖြင့်သာ သွားရသည်။ မြွေ၌ နံရိုးအမြောက်အမြားရှိ၍ တစ်ခုစီသည် ကျောရိုးအစိတ်အပိုင်းနှင့် ဆက်နေ၏။ ထိုသို့ ဆက်သည်မှာ လှုပ်ရှားမှု အများဆုံးကို ပေးနိုင်အောင် ဆက်နေကြသဖြင့် လွတ်လပ်စွာ လှုပ်ရှားသွားလာနိုင်လေသည်။</span>


                <a class="text-decoration-none text-white" href="index.php">
                    <button class="btn  mt-3 mb-3 col-4" id="snakeButton">
                        Back
                    </button>
                </a>
            </div>

        </div>
    </div>


</body>

</html>